app/controllers/telegram_webhooks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."telegram_id" = ? LIMIT ?  [["telegram_id", 617053577], ["LIMIT", 1]]
---
  def handle_message(message_data)
    chat_id = message_data.dig(:chat, :id)
    text = message_data[:text]

    log_message("💬 Processing: '#{text}' for chat #{chat_id}")

    # Находим или создаем пользователя
    user = User.find_or_create_from_telegram_message(message_data[:from])
    log_message("👤 User: #{user.telegram_id} (#{user.first_name})")