app/controllers/telegram_webhooks_controller.rb

  def message
    if params[:message]
      message = params[:message]
      text = message[:text].to_s.strip

      user = User.find_or_create_by(telegram_id: message[:from][:id]) do |u|
        u.first_name = message[:from][:first_name]
        u.last_name = message[:from][:last_name]
        u.username = message[:from][:username]
      end

      if user.current_diary_step.present? # Проверяем, находится ли пользователь в процессе заполнения дневника
---
INSERT INTO "users" ("telegram_id", "first_name", "last_name", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."telegram_id" = ? LIMIT ?  [["telegram_id", 617053577], ["LIMIT", 1]]

      message = callback_query[:message]

      # Получаем user из callback_query
      user = User.find_by(telegram_id: callback_query[:from][:id])

      case callback_data
      when 'tests'
        tests = Test.all.pluck(:name) # Получаем имена всех тестов
        test_list = tests.map.with_index { |test, index| "#{index + 1}. #{test}" }.join("\n")
---
SELECT "users".* FROM "users" WHERE "users"."telegram_id" = ? LIMIT ?  [["telegram_id", 617053577], ["LIMIT", 1]]
SELECT "tests"."name" FROM "tests"
SELECT "tests".* FROM "tests" WHERE "tests"."name" = ? LIMIT ?  [["name", "Тест Тревожности"], ["LIMIT", 1]]

  def show_test_categories(bot, chat_id, message_id, user)
    # Создаем кнопки для каждого теста
    test_buttons = []
    Test.all.each do |test|
---
SELECT "tests".* FROM "tests"

  def start_anxiety_test(bot, chat_id, user)
    test = Test.find_by(name: "Тест Тревожности")
    if test.nil?
      bot.send_message(chat_id: chat_id, text: "Тест не найден.")
      return
    end
    Rails.logger.debug "Test ID: #{test.id}"
    Rails.logger.debug "User ID: #{user.id}"
    test_result = TestResult.new(user: user, test: test) # Создаем объект TestResult

    if test_result.save # Пытаемся сохранить
      Rails.logger.debug "TestResult ID: #{test_result.id}"
      question = test.questions.first
---
SELECT "tests".* FROM "tests" WHERE "tests"."name" = ? LIMIT ?  [["name", "Тест EQ (Эмоциональный Интеллект)"], ["LIMIT", 1]]
INSERT INTO "test_results" ("user_id", "test_id", "score", "completed_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["test_id", 3], ["score", nil], ["completed_at", nil], ["created_at", "2025-10-20 06:25:10.488372"], ["updated_at", "2025-10-20 06:25:10.488372"]]
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 3], ["LIMIT", 1]]

  def start_luscher_test(bot, chat_id, user)
       test = Test.find_by(name: "8-ми цветовой тест Люшера")
       if test.nil?
         bot.send_message(chat_id: chat_id, text: "Тест не найден.")
         return
       end

       #  Находим все незавершенные результаты теста Люшера для этого пользователя
       #  и помечаем их как завершенные, чтобы они не мешали новому тесту.
       TestResult.where(user: user, test: test, completed_at: nil).update_all(completed_at: Time.now, luscher_stage: :completed)

       test_result = TestResult.create(user: user, test: test, luscher_stage: :stage_one, luscher_choices: []) # Убедитесь, что luscher_stage: :stage_one
---
SELECT "tests".* FROM "tests" WHERE "tests"."name" = ? LIMIT ?  [["name", "8-ми цветовой тест Люшера"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "current_diary_step" = ?, "diary_data" = ? WHERE "users"."id" = ?  [["updated_at", "2025-10-18 13:00:22.851408"], ["current_diary_step", nil], ["diary_data", "{}"], ["id", 1]]
UPDATE "test_results" SET "completed_at" = ?, "luscher_stage" = ? WHERE "test_results"."user_id" = ? AND "test_results"."test_id" = ? AND "test_results"."completed_at" IS NULL  [["completed_at", "2025-10-21 04:52:17.050500"], ["luscher_stage", 3], ["user_id", 1], ["test_id", 10]]
INSERT INTO "test_results" ("user_id", "test_id", "score", "completed_at", "created_at", "updated_at", "luscher_choices", "luscher_stage") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def start_luscher_stage_two(bot, chat_id, user)
    test = Test.find_by(name: "8-ми цветовой тест Люшера")
    test_result = TestResult.find_by(user: user, test: test, completed_at: nil)

    # Очищаем luscher_choices для второго этапа
    test_result.update(luscher_choices: [])
---
SELECT "tests".* FROM "tests" WHERE "tests"."name" = ? LIMIT ?  [["name", "8-ми цветовой тест Люшера"], ["LIMIT", 1]]
SELECT "test_results".* FROM "test_results" WHERE "test_results"."user_id" = ? AND "test_results"."test_id" = ? AND "test_results"."completed_at" IS NULL LIMIT ?  [["user_id", 1], ["test_id", 10], ["LIMIT", 1]]
UPDATE "test_results" SET "updated_at" = ?, "luscher_choices" = ? WHERE "test_results"."id" = ?  [["updated_at", "2025-10-21 04:55:16.686316"], ["luscher_choices", nil], ["id", 24]]

  def process_luscher_choice(bot, chat_id, user, color_code, message_id)
  test = Test.find_by(name: "8-ми цветовой тест Люшера")
  test_result = TestResult.find_by(user: user, test: test, completed_at: nil)

  current_choices = test_result.luscher_choices || []
  current_choices << color_code
  test_result.update(luscher_choices: current_choices)

  test_result.reload

  available_colors = COLOURS.reject { |c| current_choices.include?(c[:code]) }

  Rails.logger.debug "Текущие выборы: #{current_choices.inspect}"
  Rails.logger.debug "Доступные цвета: #{available_colors.count}"
  Rails.logger.debug "luscher_stage (после перезагрузки): #{test_result.luscher_stage.inspect}"

  if available_colors.empty?
    Rails.logger.debug "Этап закончен"
    if test_result.luscher_stage == "stage_one" # ИЗМЕНЕНО: Сравнение со строкой
      Rails.logger.debug "Переход к этапу 2"
      test_result.update(luscher_stage: :stage_two)
      bot.send_message(chat_id: chat_id, text: "Ты выбрал все 8 цветов! Вот твой список в порядке убывания предпочтения:\n#{test_result.luscher_choices.map.with_index { |code, index| "#{index+1}. #{COLOURS.find { |c| c[:code] == code }[:name]}"}.join("\n")}\n\nТеперь сделай небольшой перерыв (5-10 минут). Когда будешь готов, нажми кнопку \"Начать второй этап\".",
                       reply_markup: { inline_keyboard: [[{ text: 'Начать второй этап', callback_data: 'start_luscher_stage_two' }]] }.to_json)
    elsif test_result.luscher_stage == "stage_two" # ИЗМЕНЕНО: Сравнение со строкой
      Rails.logger.debug "Тест завершен"
      test_result.update(luscher_stage: :completed, completed_at: Time.now)
---
SELECT "tests".* FROM "tests" WHERE "tests"."name" = ? LIMIT ?  [["name", "8-ми цветовой тест Люшера"], ["LIMIT", 1]]
SELECT "test_results".* FROM "test_results" WHERE "test_results"."user_id" = ? AND "test_results"."test_id" = ? AND "test_results"."completed_at" IS NULL LIMIT ?  [["user_id", 1], ["test_id", 10], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "current_diary_step" = ?, "diary_data" = ? WHERE "users"."id" = ?  [["updated_at", "2025-10-20 05:27:24.921096"], ["current_diary_step", nil], ["diary_data", "{}"], ["id", 1]]
UPDATE "test_results" SET "updated_at" = ?, "luscher_choices" = ? WHERE "test_results"."id" = ?  [["updated_at", "2025-10-21 04:52:18.906306"], ["luscher_choices", "[\"red\"]"], ["id", 23]]
UPDATE "test_results" SET "updated_at" = ?, "luscher_stage" = ? WHERE "test_results"."id" = ?  [["updated_at", "2025-10-21 04:55:07.111823"], ["luscher_stage", 2], ["id", 24]]
SELECT "test_results".* FROM "test_results" WHERE "test_results"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "test_results" SET "completed_at" = ?, "updated_at" = ?, "luscher_stage" = ? WHERE "test_results"."id" = ?  [["completed_at", "2025-10-21 04:55:33.885675"], ["updated_at", "2025-10-21 04:55:33.886977"], ["luscher_stage", 3], ["id", 24]]

  def show_luscher_interpretation(bot, chat_id, user)
    test = Test.find_by(name: "8-ми цветовой тест Люшера")
    test_result = TestResult.find_by(user: user, test: test, completed_at: nil) || TestResult.find_by(user: user, test: test)
---
SELECT "tests".* FROM "tests" WHERE "tests"."name" = ? LIMIT ?  [["name", "8-ми цветовой тест Люшера"], ["LIMIT", 1]]
SELECT "test_results".* FROM "test_results" WHERE "test_results"."user_id" = ? AND "test_results"."test_id" = ? AND "test_results"."completed_at" IS NULL LIMIT ?  [["user_id", 1], ["test_id", 10], ["LIMIT", 1]]